{
  "classes": [
    {
      "class": {
        "dept": "ENGR",
        "num": "102",
        "section": "549",
        "full": "ENGR-102-549"
      },
      "name": "ENGR LAB I COMPUTATION-GV",
      "campus": "CS",
      "hours": "2",
      "id": "47561",
      "prof": "Ahmed Al-Ramthan",
      "dates": [
        {
          "date": "2024-08-19 / 2024-12-10",
          "days": [
            "M"
          ],
          "timeStart": "17:01",
          "timeEnd": "18:00",
          "building": {
            "name": "CLB",
            "room": "103",
            "type": "LAB"
          }
        },
        {
          "date": "2024-08-19 / 2024-12-10",
          "days": [
            "W"
          ],
          "timeStart": "16:10",
          "timeEnd": "18:00",
          "building": {
            "name": "CLB",
            "room": "103",
            "type": "LAB"
          }
        },
        {
          "date": "2024-08-19 / 2024-12-10",
          "days": [
            "M"
          ],
          "timeStart": "16:10",
          "timeEnd": "17:00",
          "building": {
            "name": "CLB",
            "room": "103",
            "type": "LEC"
          }
        }
      ],
      "grades": {
        "data_available": false,
        "data": {
          "Average_GPA": "N/A",
          "A_percentage": "N/A",
          "Total_Students_Taught": "N/A"
        },
        "past_classes": "N/A"
      },
      "ratings": {
        "reviews": [],
        "overall": "N/A",
        "isMandatory": "N/A",
        "difficulty": "N/A"
      }
    },
    {
      "class": {
        "dept": "CHEM",
        "num": "107",
        "section": "405",
        "full": "CHEM-107-405"
      },
      "name": "GEN CHEM FOR ENGINEERS",
      "campus": "GV",
      "hours": "3",
      "id": "30428",
      "prof": "Carl Aronson",
      "dates": [
        {
          "date": "2024-08-19 / 2024-12-10",
          "building": {
            "name": "MAIN",
            "room": "117",
            "type": "LEC"
          },
          "days": [
            "T",
            "R"
          ],
          "timeStart": "09:35",
          "timeEnd": "10:50"
        }
      ],
      "grades": {
        "data_available": false,
        "data": {
          "Average_GPA": "N/A",
          "A_percentage": "N/A",
          "Total_Students_Taught": "N/A"
        },
        "past_classes": "N/A"
      },
      "ratings": {
        "reviews": [
          "AVOID PLEASE He sucks",
          "Bro never used to teach, just came to class to yap and tell jokes. He would then proceed to give the hardest homeworks and tests known to mankind, on top of that youd get like 5 tests and a final in one semester. He's super weird with the grading too and barely gives extra credit. Don't take this guy. ",
          "What is wrong with this guy man?",
          "fat and easy to kite",
          "Try to avoid him. The tests are computer, webcam on, multiple choice, 35 ish questions. The tests are RNG from a q-bank, you either get lucky or not with the questions. I unfortunately didn't, but I had friends that literally had just 35 conceptual questions which is easy. The class is curved-based, so if you want an A or a B, stay above the curve",
          "You will spend all of your semester attempting to complete his hw's. The tests, Goodluck try praying beforehand. His lectures are basically talking abt Disney (for some reason). If you want the slightest chance of passing, you'll need to learn the textbook front and back. This course left me and basically everybody scarred. Switch to the other prof",
          "Professor Aronson has a great personality and is fun to talk to but, he does not teach well, and the test are nothing like the homework assignments.",
          "Aronson is overhated by salty engineers. The course is rough but that's OChem. The only grades are quizzes and homework, both of which have multiple attempts per question. Some outside learning may be required at times but Aronson will usually help you as well. ACTIVE is annoying at times but it could be worse.",
          "He definitely is not the a good lecturer, but you will need to go because he does iclicker every class. You will definitely learn mostly on your own, go to the offered tutoring sessions if possible. He is very helpful outside of class, if you email him a question he will typically answer within the day with steps and reasoning. Big curves on tests.",
          "Overall Professor Aronson was a bad lecturer. However, he is almost always on campus for the entire day if he has a class that day. Outside of lectures, he is very open to helping out on something if you are confused. Make sure to do the recitations as they are very helpful on the exam. The first exam is almost al memorization so be ready for that.",
          "Aronson's low rating is unjustified. He is a poor lecturer so expect lots of self-study but he is extremely nice. He gives huge curves so do your hw and read the textbook and you will be fine. Also, go over your tests with him. He gives free points like candy which can boost your grade by almost a whole letter. ",
          "I'm going to be clear. His class is very entertaining to go to... but that's the only good thing. The homework is super long and unclear, The test are extremally difficult with every question being a trick question, and the lectures are taught in the most awful way possible there is little point to pay attention in the class. ",
          "If you can, avoid taking him. His lectures are almost never helpful on the test and you are forced to learn exam material on your own. Luckily there are curves on exams and extra credit opportunities like study sessions and recitations, where the recitations are even helpful on the first five exams. None of that really helps during finals though.",
          " Only take his class if you are a really good test taker. The tests are all luck based, you may get a lot of easy questions or the hardest questions possible however usually it balances out. Nice Professor, the recitations are questions straight out of the test, use them to study and understand how to do them. prepare to cry after your first test.",
          "Be ready to sit through his nonstop exceptionally horrible lectures. You will spend hours on end studying every week. The tests are extremely difficult but luckily the curve he gives is huge. Make sure to get comfortable quick because it is very fast paced. Do ALL the recitations and go to all of the tutoring sessions to get extra credit!!!",
          "The guy was funny but not a single thing that was in his lectures came up on the test, nor the 300 question assignments due every week. There is no proper way to study for his exams and you just have to hope you get a 40 or 50 on all the exams because the only thing that allows people to pass his class is the curve on all of the test. Worst Prof.",
          "Very hard professor and doesn't lecture on the material that will be covered on the exams which are very frequent. Be prepared to read the textbook alot and spend alot of time studying. Take Nair if possible.",
          "Aronson cannot teach to save his life. He skims through the lecture slides and expect us to already know the stuff. He goes through 100 slides a day. He spends 30 seconds on each slide and does not explain thoroughly in detail. He assigns 300 homework questions and it does not help us on exams. Please take Nair.",
          "He wastes so much time in class on meaningful things. His iClickers have no correlation to the topic being testes on, not to mention the fact that it is completely nonsensical to ask students questions on a topic they have just been taught!",
          "lost life meaning and hope in 106 questions of aktiv in this week"
        ],
        "overall": 1.6,
        "isMandatory": true,
        "difficulty": 4.9
      }
    },
    {
      "class": {
        "dept": "CHEM",
        "num": "117",
        "section": "408",
        "full": "CHEM-117-408"
      },
      "name": "GEN CHEM FOR ENGR LAB",
      "campus": "GV",
      "hours": "1",
      "id": "30334",
      "prof": "Grace Townsend",
      "dates": [
        {
          "date": "2024-08-19 / 2024-12-10",
          "building": {
            "name": "MAIN",
            "room": "310",
            "type": "LAB"
          },
          "days": [
            "W"
          ],
          "timeStart": "08:00",
          "timeEnd": "10:50"
        }
      ],
      "grades": {
        "data_available": false,
        "data": {
          "Average_GPA": "N/A",
          "A_percentage": "N/A",
          "Total_Students_Taught": "N/A"
        },
        "past_classes": "N/A"
      },
      "ratings": {
        "reviews": [
          "Dr Townsed is a great person,however she just reads off of slides.Relies on ALEKS for questions with Calculations. My suggestion is if you take this class DO YOU ALEKS as it is a big part of your grade and understanding the class. Tests are just copied and pasted Qs from ALEKS. She tries her best to help, will round up grade if close enough to pass",
          "Terrible professor, wouldn't recommend, take Galan if you can. Showed up late to her own lecture would just read off the slides and would not know how to answer students questions. Class averages were failing for every test, but they don't make up too much of the class. ",
          "I love this woman. But, I also like chemistry so that made it easier. Meet with her for office hours, talk about the concepts, and try to understand why things work rather than what they are. Go to the Library for help with homework from TA and student tutors through Navigate.  Tests are more on presentations than ALEKS. LEARNING OUTCOMES!!!",
          "Professor Townsend is very lectured based, so be prepared to learn. Make sure to go to office hours when possible before any of the exams. Make sure to not fall behind with the ALEKS homework, she does a good job reminding her students about that. TEST DO NOT MAKE UP YOUR ENTIRE GRADE! She makes that very clear, which gave me a lot of relief. ",
          "Prof Townsend is nice and easy to talk to outside of lecture, but her class can be pretty challenging. Lots of hw from ALEKS and lab. Lectures either make sense, or don't depending on how in depth she goes. Answers any questions you have in class and has daily grades each lecture for attendance. Tests and quizzes are based off ALEKS.",
          "The TA you get will make or break your class. I had Hojjat Anvari, and he didn't seem to know what was going on. I've heard that another TA, Muhammet, is bad too. Please be sure to show up every day on time, or else they will take off major points. The final is impossible to study for, so get ready to drop a letter grade at the end of the year.",
          "Each lecture has a \"daily grade\" that you turn in at the end of class in place of attendance. They go along with the previous lecture and she walks you through them. The quizzes are partly ALEKS and questions from class and are worth most of your grade so study for these. She will take the time to walk around and answer q's during lectures! ",
          "Unclear assignments, uncooperative graders, clueless TAs, random critical announcements, and assignments with no due date. Prepare to miss at least one class, and thus a lab or quiz because of how utterly unorganized this class is. If you enquire about assignments, you will be sent on a merry-go-round the easter bunny would be proud of. \nShambles.",
          "Townsend is a great professor by all means. Her homework assignments and lectures do not match at all though, and she would go weeks without posting the lecture for students to catch up. It's anger inducing when this happens, regardless she cares and will do anything to make sure you learn.",
          "Dr. Townsend is a great professor, will answer questions if you have any about your grade or lecture material.  Dr. Townsend also gives good feedback on how you can improve in the class. As long as you do your ALEKS math you will do fine in the class. ",
          "Dr. Townsend has been my favorite professor by far. I took her for Chem 119 as well, and she has only gotten better in my opinion. Main portion of grade is from 6 quizzes which are easy if you do ALEKS. Do ALEKS and pay attention in class and you should get a good grade. Also a great person outside of the professor role- wrote me 2 letters of rec.",
          "Townsend was an amazing professor. She teaches well and cares for her students. Very easy to undertsnd and the way she teaches depends on the student you are, but she takes her time and is very patient. She wants her students to learn and to understand things. I would take her for chem 120 but i am leaving to main campus. ",
          "Professor Townsend cares about her students and relays information very well during lectures and when responding to questions. If you do the ALEKS on pace with the class lecture and participate in class, you'll most likely get an A. Also, go to tutoring at least once a week because this class isn't an easy A and requires some outside effort.",
          "Dr. Townsend is an amazing professor- really made me love chemistry. Lectures are great for explaining the things you learn in ALEKS. Do ALEKS before lectures and you will be great. Take good notes because quizzes are modeled after ALEKS questions. Should be an easy A if you put in the work, especially in ALEKS. She is an amazing person overall. ",
          "I've never seen Townsend as the class is run by TA's. The TA that you get could make or break your grade as some are very strict graders. You must show up to every lab on time or you will lose lots of points. At the beginning of every lab there is a quiz on material that was not covered. The final is awful, and you can't really study for it.",
          "It's a TA ran course, depending on who your TA is. I got Jaclynn Turnbaugh and as long as you're not late to class you'll make an A or B. The final of this class is impossible to study for, write your post-lab answers down on your prelabs, and remember the quizzes you take for the labs. DON'T BE LATE EVER, U'LL GET A 0 FOR A LOT OF THINGS.",
          "Class is entirely run by TAs and communication is extremely limited. The posted assignments each week are extremally vague and contain conflicting information. Assignment files will get randomly swapped out for new ones without notification which caused me to have incomplete assignments as they were the \"wrong\" version.",
          "When I came into this semester as a Freshman, Chemistry was one of the classes I was most worried about. Professor Townsend really eased this as she has a very caring personality and really takes her time to go over questions during lecture.",
          "Her TAs are incredibly lazy and take weeks to grade stuff, or sometimes even wait until last minute to do it. Class wasn't hard, but the grading system is the strictest pile of garbage I have seen in a while. Late work is not accepted AT ALL, and if you mess up on one assignment like I did by accident, say goodbye to your opportunity for an A.",
          "Bruh I have never seen her before. Sometimes the post labs can have weird questions and it doesn't help when she hard to reach out for."
        ],
        "overall": 3.5,
        "isMandatory": true,
        "difficulty": 3.5
      }
    },
    {
      "class": {
        "dept": "CLGV",
        "num": "001",
        "section": "417",
        "full": "CLGV-001-417"
      },
      "name": "HU: Light House LLC",
      "campus": "GV",
      "hours": "0",
      "id": "31659",
      "prof": "Jillian Sanchez",
      "dates": [
        {
          "date": "2024-08-19 / 2024-12-10",
          "building": {
            "name": "PMEC",
            "room": "239",
            "type": "INS"
          },
          "days": [
            "F"
          ],
          "timeStart": "12:00",
          "timeEnd": "12:50"
        }
      ],
      "grades": {
        "data_available": false,
        "data": {
          "Average_GPA": "N/A",
          "A_percentage": "N/A",
          "Total_Students_Taught": "N/A"
        },
        "past_classes": "N/A"
      },
      "ratings": {
        "reviews": [],
        "overall": "N/A",
        "isMandatory": "N/A",
        "difficulty": "N/A"
      }
    },
    {
      "class": {
        "dept": "MATH",
        "num": "251",
        "section": "401",
        "full": "MATH-251-401"
      },
      "name": "ENGINEERING MATH III",
      "campus": "GV",
      "hours": "3",
      "id": "30391",
      "prof": "Cong Kang",
      "dates": [
        {
          "date": "2024-08-19 / 2024-12-10",
          "building": {
            "name": "MAIN",
            "room": "218",
            "type": "LEC"
          },
          "days": [
            "T",
            "R"
          ],
          "timeStart": "15:55",
          "timeEnd": "17:10"
        }
      ],
      "grades": {
        "data_available": false,
        "data": {
          "Average_GPA": "N/A",
          "A_percentage": "N/A",
          "Total_Students_Taught": "N/A"
        },
        "past_classes": "N/A"
      },
      "ratings": {
        "reviews": [
          "Very very great lectures. The best of all intro math courses at TAMUG. Goes in tons of detail (sometimes on slight tangents) and seemed to be really passionate about helping everyone understand the material. The only downside to the course is the whole grade relies on a few things, but if you pay attention in lectures, you should be fine.",
          "You can tell that Dr. Kang is very passionate about math, which I respect; however, he does go on tangents, which sometimes makes him a bit difficult to understand. We were only graded by five quizzes and two exams, so I would not recommend him if you rely on homework or classwork to boost your grade. He does give a generous curve on the quizzes.",
          "Dr. Kang is really good at teaching concepts and their applications, but he goes on tangents a LOT. The pop quizzes are very similar to what he teaches in the lectures, they're not hard if you study a bit. Quizzes and midterm are closed book, but he allows a 1-sided notepage for the final. Homework is optional. He also curves the class at the end.",
          "He only did two tests and five quizzes. So it was super easy that I never studied and I'm dying right now because he barely grades so don't take that for advantage. He is super sweet and laughs at his own jokes I love it. This class is so easy I never studied, DONT DO WHAT I DID!",
          "Dr. Kang is a good professor, but he tends to go get sidetracked often into math tangents that can be harder to understand than the material itself. Although optional, the homework really helps if you are struggling during the lectures. The pop quizzes are a large part of your grade so make sure you are up to date on the material.",
          "Kang is a pretty good teacher for the most part. He tends to go off on tangents during the lectures pretty often, but there's usually some good info buried somewhere in there. Nice guy, and pretty lenient grader, if you didn't take calc in high school you might have a harder time but if you pay attention in class and take good notes you'll be fine.",
          "Dr. Cong really likes to make sure you understand the material so he takes his time at lectures. I didn't have any &quot;exams&quot; during the semester just quizzes until the final. He gives fun lectures and he's great remote or in person.",
          "Cong Kang definitely is a hard grader. Despite I have gotten an A, but i feel I might be one of the very few person who do. Dr. Kang's free response problems are minimal in concept, but great in arithmetic means. . The conceptual multiple choice problems requires a solid understanding to multivariable calculus.",
          "Only put in 2 quizzes and 3 tests all semester. Very theory heavy. Tests are usually 15 questions long, 8 being True or False on math theory. If your a math major, this would be a good class. He is also very hard to catch out of class and does not negotiate well. Only thing good is that he can be funny at times.",
          "The content is already confusing and hard to grasp and he makes it even harder to learn. I spent most of my time and energy on this class and still did meh. My grade was made up from 1 quiz 2 test 1 final. Hard to catch outside of class, hard grader and non negotiable.",
          "Great Professor. During his rambling lectures it may seem that he is losing focus on the material, but he is simply filling your brain with useful advice. Tests and quizzes are not hard if you keep up with the homework. He is a mystic and challenges the norms for calculus professors.",
          "I took Dr. Kang for Math 151 and 152 and would take him again if I could. He is a really solid teacher. The homework was optional, but it helped so much. There were pop quizzes that he would give every few weeks, but as long as you're up to date on the homework, you should be fine. He let us use a cheat sheet on the 152 final which was SO helpful.",
          "Dr. Kang is a really good professor, he is really thorough with his lectures and is always willing to answer any questions you have. Homework is optional so I used it to study for the tests. Also he replaces your lowest test grade with the final.",
          "Great prof really wants you to learn. Classes can be a little boring especially if you've taken calc in high school. Only 2 exams and a final he will replace one exam with the final if its higher. 60% multiple choice for the 2 exams 100% multiple choice for the final. He is definitely quirky and can be odd, but he's a great guy.",
          "Kang's lectures were interesting. Homework wasn't graded but I encourage you do it. His tests and quizzes were wayyy harder than anything he will teach in class.",
          "Kang is a good math teacher but his pop quizzes and tests are REALLY HARD. His quizzes are 6 free response questions and his tests are 25 multiple choice so there is no chance of getting partial credit. He also lets you use a note card. The homeworks are optional. His lectures are pretty funny. Avoid Dr. Kang if you can and take Dr. Suen instead.",
          "I took calc 3 twice; Dr. Kang is the best math prof I've had at TAMUG. He gives very detailed lectures, be sure to take good notes. ALL test material is given through the lectures and quizzes. Quiz keys are posted online after the fact. He is a HUGE help if you go to him during his office hours, spent 2 hours on one subject to be sure I understood.",
          "You don't need to do homework but it is extremely helpful for practice and understanding. You get a note card of help for tests, but it is a little tough.",
          "I took his class for Math 141 and 142. Great professor! He has a different teaching style, but if you get it, then you are golden. He lets you use a notecard on all your exams and he is very fair in grading. Really enjoyed his class.",
          "Made an A, listen to him and let him teach and it will pay off. Never did one homework, but study the pre tests. They are just like the real things with different numbers."
        ],
        "overall": 3.3,
        "isMandatory": false,
        "difficulty": 3.3
      }
    },
    {
      "class": {
        "dept": "STAT",
        "num": "211",
        "section": "400",
        "full": "STAT-211-400"
      },
      "name": "PRIN OF STATISTICS I",
      "campus": "GV",
      "hours": "3",
      "id": "31875",
      "prof": "Carmen Acero-Schertzer",
      "dates": [
        {
          "date": "2024-08-19 / 2024-12-10",
          "building": {
            "name": "KIRK",
            "room": "207",
            "type": "LEC"
          },
          "days": [
            "T",
            "R"
          ],
          "timeStart": "11:10",
          "timeEnd": "12:25"
        }
      ],
      "grades": {
        "data_available": false,
        "data": {
          "Average_GPA": "N/A",
          "A_percentage": "N/A",
          "Total_Students_Taught": "N/A"
        },
        "past_classes": "N/A"
      },
      "ratings": {
        "reviews": [
          "I have no idea what's going on in her class. I have to teach myself everything, and that seems to be the general consensus with everyone else. She talks so fast she gets herself out of breath, frequently solves problems wrong, and panics easily, making the class even worse. ",
          "Do not take this class. Tried going to her office hours for math help and she just told me to go study. She does not teach in class, she reads off the slides, is very quiet, has technical problems, and you have to teach yourself everything. Exams are on lockdown in class. If you want to drop your GPA, take this class. ",
          "Does not teach, just reads off of slides so you have to teach yourself everything. Very bad with technology so any issues on WebAssign will almost never get fixed. By the end of the semester I stopped showing up to class because her lectures were a waste of time. Very inconsistent with how she grades her tests. Avoid her as much as possible. ",
          "I wouldn't recommend this teacher for Math 150 and 151. She doesn't teach well and only goes over the slides. She posts all the homework on WebAssign for you to complete with little questions that are rarely on the test. Out of the test I have taken, she doesn't put questions taught in class or on the homework. I recommend taking someone else.",
          "The reviews on this professor are not an exaggeration. You really won't learn anything and even simple concepts will become extremely confusing. Her tests are similar to the homework but she will frequently add another element to the problems that she did not go over in class, so you'll know how to do it, but won't know how to do it. Don't take.",
          "Very nice and caring lady, but awful at teaching. She simply reads over the slides that she wrote (and will still get the examples wrong)\nI did better just watching ochem tutor, exams are open note write formulas and how to solve, study the homework and quizzes because that's what will be on the test. Retakes will generally have the same questions.",
          "The professor spent 3 months on basic linear equations and then sped through all of trigonometry in one week and then gave us the final. she has no idea how to teach a class and should not be taken unless you already know the topics she is teaching.",
          "She was not good at this subject. Her grasp of technology is poor which is a problem-assignments, quizzes and tests are online. The university provided tutor could not help, be prepared to teach yourself. She could not work her own review problems in class. Avoid if possible. She did not understand accommodations. ",
          "Carmen is a very nice person but she doesn't really teach. Her lectures are straight from powerpoints. The coursework was, for the most part, easy until around the last three weeks. We were behind so we speedran the remaining units. Subsequently, the last two exams had very poor scores (around 50% on average). She did allow retakes, however.",
          "just utterly bad, just dont",
          "Super sweet lady, just does not know how to teach properly. She works the problems out in her head and expect you to follow along. ",
          "she just reads from slides that are posted online. iclicker is important and she relys on it for attendance and in class quizzes",
          "This professor is very strict in her teaching beliefs and holds her students to high standards without offering the academic support the students need to achieve her standards. She uses an online math program that is difficult to use and unreliable often causing detriment to students ability to understand the lessons and concept. ",
          "Although she has difficulty working technology, her homework and quizzes are straightforward. If you pay attention by taking notes, she isn't bad at all. Just look over the material and practice the problems. ",
          "You will hate this class. She has somehow mad simple concepts seem impossible due to the fact you cant understand a word she says. Her microphone doesnt help and she also doesnt know how to use it. I find myself spending most of the class trying to translate what she said to comprehensible English. Use khan academy because she wont teach you sh",
          "You will not be able to understand a single word that comes out of this womans mouth. She doesnt know how to use technology and even if she did you wouldnt even be able to tell that this is english. Overall, your real professor is going to be Khan Academy because she wont teach you anything......It affects my mental health most days DROP THIS CLASS",
          "Avoid this class at all costs.. you will not learn anything. you will have to teach yourself the math. you can barely hear her through the microphone unless you're sitting in the front row and you can't even understand her. She has a very thick accent and struggles with technology. Has no idea what's she's doing or teaching. I would drop If I could",
          "Very disorganized, she would often do examples on the board but would confuse herself in the process and eventually give up. When I asked for help all she said was &quot;It's easy, you can solve it&quot;, in fact I couldn't solve it and I ended up failing due to the lack of help in that class. AVOID AT ALL COST.",
          "This professor is so nice and really tries her best to make sure we understand everything. However, she has a thick accent and it makes it hard to understand her. I am good at math, but I struggled so much in this course and I cried during the last exam. It was unbelievably hard. I would avoid this professor if you can but she is very sweet.",
          "The first day of class she wrote on the whiteboard with sharpie and that set the tone for the rest of the semester. She is very soft spoken and has a bit of an accent so it was very hard to hear her. She would do examples on the projector but often had her paper off to the side so we could not see her work. Very nice lady but disorganized."
        ],
        "overall": 2.1,
        "isMandatory": true,
        "difficulty": 3.75
      }
    }
  ],
  "schedule": {},
  "user_name": "Isaac I Burns (935007106)",
  "semester": "Fall 2024"
}